# Завдання 1. Створити репозиторій, додати файл main.py, у файлі створити
# функцію main_function(), додати код. Послідновно додати 3 коміти
# у гілці master після додавння трьох рядків коду.
# Переключитися на гілку test, створити функцію test_function(), додати код.
# Послідновно додати 2 коміти у гілці test.
# Виконати шляхом злиття об’єдання гілок master і test. Git повідомить
# про конфлікт. Вирішити конфлікт. Зробити коміт у гілці master.


# Функція, яка рахує числа Фібоначчі.
def main_function(n):
    if n < 0:
        print('Not correct value')
    elif n == 0:
        return 0
    elif n == 1 or n == 2:
        return 1
    '''Далі ще буде 2 рядки коду'''






